app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT "statuses".* FROM "statuses"

  def show
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @status = current_user.statuses.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "I'm on Treebook!"], ["created_at", Sat, 20 Oct 2012 00:28:16 UTC +00:00], ["name", "Jason"], ["updated_at", Sat, 20 Oct 2012 00:28:16 UTC +00:00]]

  def update
    @status = current_user.statuses.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)
      params[:status].delete(:user_id)
    end
    respond_to do |format|
      if @status.update_attributes(params[:status])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "statuses" SET "content" = 'Baby OY', "updated_at" = '2012-10-20 04:34:23.764200' WHERE "statuses"."id" = 3

  def destroy
    @status = Status.find(params[:id])
    @status.destroy
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 4]]